# Напишите программу, которая выводит на экран числа от 10 до 19.

for i in range(10, 20, +1):
    print(i)