# Дан список чисел – [8, 4, 7, 3, 9, 2, 5].
# Напишите программу, которая выводит все значения
# из этого списка на экран – каждое
# значение с новой строки.

numbers = [8, 4, 7, 3, 9, 2, 5]

for index in range(len(numbers)):
    print(numbers[index])