# Создайте список, который содержит несколько названий фруктов.
# Выведите его на экран так, чтобы каждое название выводилось с новой строки.

fruits = ["lemon", "orange", "kiwi", "mango"]

for fruit in fruits:
    print(fruit)
