# Напишите программу, которая выводит на экран числа от 15 до 1.

counter = 15

while counter > 0:
    print(counter)
    counter -= 1

for i in range(15, 0, -1):
    print(i)
