#  Напишите программу, которая выведет на экран фразу «Hello!» пять раз.

counter = 0

while counter < 5:
    print("Hello!")
    counter = counter + 1
