# Напишите программу, которая выведет на экран фразу «Hello!» пять раз.
# при этом пронумеровав строки от 1 до 5.

for i in range(5):
    print(i + 1, "Hello!")