# Напишите программу, которая выводит на экран числа от 0 до 9.

counter = 0

while True:
    print(counter)
    if counter == 9:
        break
    counter += 1
