#  Напишите программу, которая выведет на экран фразу «Hello!» пять раз.

print("Hello!")
print("Hello!")
print("Hello!")
print("Hello!")
print("Hello!")

