# Напишите программу, которая выводит на экран числа от 0 до 9.

for number in range(10):
    print(number)

# Рекомендация, как выбрать, какой цикл использовать для той или иной задачи.
# Если вы заранее знаете количество итераций - выбирайте for.
# Если количество итераций заранее неизвестно - скорее всего удобнее будет while.