# Напишите программу, которая выведет на экран фразу «Hello!» пять раз.
# при этом пронумеровав строки от 1 до 5.

counter = 0

while counter < 5:
    counter += 1
    print(counter, "Hello!")

