# Напишите программу, которая выведет на экран фразу «Hello!» пять раз.

for i in range(5):
    print("Hello!")