# Напишите программу, которая выводит на экран числа от 0 до 9.

counter = 0

while counter < 10:
    print(counter)
    counter += 1


